Catalogs/ЛБ_ОснованияИзмененияФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ОснованияИзмененияФИО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛБ_Залогодатели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЛБ_ПричинаИзмененияФИО/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Параметры.Свойство("Залогодатель") Тогда
		Клиент = Параметры.Залогодатель;   
	Иначе	
		Возврат; 
	КонецЕсли;	
	
	// ++ Сербаев 10.05.2023
	//ПричинаИзмененияФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация;
	Элементы.ПричинаИзмененияФИО.Видимость = Ложь;
	ПричинаИзмененияФИО_ИсправлениеФИО = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИсправлениеДанныхКонтактнаяИнформация;
	ПричинаИзменения_СменаФИО          = Справочники.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИзменениеФИО;
    // -- Сербаев 10.05.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаИзмененияФИОПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	// ++ Сербаев 10.05.2023
	//Если ПричинаИзмененияФИО  = ПредопределенноеЗначение("Справочник.ЛБ_ПричиныИзмененияКарточкиЗалогодателя.ИзменениеФИО") Тогда 
	Если ВыбранаСменаФИО Тогда
	// -- Сербаев 10.05.2023	
		Элементы.Документ.Видимость = Истина;  
		Элементы.Номер.Видимость = Истина;
		Элементы.Дата.Видимость = Истина; 
		Элементы.Серия.Видимость = Истина;
		Элементы.КемВыдан.Видимость = Истина;
	Иначе
		Элементы.Документ.Видимость = Ложь;  
		Элементы.Номер.Видимость = Ложь;
		Элементы.Дата.Видимость = Ложь; 
		Элементы.Серия.Видимость = Ложь;
		Элементы.КемВыдан.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОснованиеИзмененияФИО()
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Справочники.ЛБ_ОснованияИзмененияФИО.ПустаяСсылка();
	Иначе
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("Владелец", Клиент); 
		Запрос.УстановитьПараметр("Документ", Документ);
        Запрос.УстановитьПараметр("Номер", Номер);
		Запрос.УстановитьПараметр("Серия", Серия);
        Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.Текст ="ВЫБРАТЬ
		              |	ЛБ_ОснованияИзмененияФИО.Ссылка КАК Ссылка
		              |ИЗ
		              |	Справочник.ЛБ_ОснованияИзмененияФИО КАК ЛБ_ОснованияИзмененияФИО
		              |ГДЕ
		              |	ЛБ_ОснованияИзмененияФИО.Документ = &Документ 
					  |	И ЛБ_ОснованияИзмененияФИО.Серия = &Серия
		              |	И ЛБ_ОснованияИзмененияФИО.Номер = &Номер
		              |	И ЛБ_ОснованияИзмененияФИО.Дата = &Дата
		              |	И ЛБ_ОснованияИзмененияФИО.Владелец = &Владелец";
		              
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.Ссылка;
		Иначе 
			НовыйСпр = Справочники.ЛБ_ОснованияИзмененияФИО.СоздатьЭлемент();
			НовыйСпр.Владелец = Клиент;
			НовыйСпр.Документ = Документ;
			НовыйСпр.Дата = Дата;    
			НовыйСпр.Серия = Серия;
			НовыйСпр.КемВыдан = КемВыдан; 
			НовыйСпр.Номер = Номер;
			НовыйСпр.Наименование = СокрЛП(НовыйСпр.Документ) + ?(ПустаяСтрока(НовыйСпр.Серия), СокрЛП(НовыйСпр.Серия), "") + " № " + СокрЛП(НовыйСпр.Номер) + " от " + Формат(НовыйСпр.Дата, "ДФ=dd.MM.yyyy");
			
			НовыйСпр.Записать();
			Возврат НовыйСпр.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура Выбрать(Команда)
	
	// ++ Сербаев 10.05.2023
	//Если НЕ ЗначениеЗаполнено(ПричинаИзмененияФИО) Тогда
	//	Сообщить("Не выбрана причина изменения!");
	//	Возврат;
	//КонецЕсли; 
	
	Если Не ВыбраноИсправлениеФИО И Не ВыбранаСменаФИО Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана причина изменения!'"));
	    Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Документ) Тогда
	Если ВыбранаСменаФИО Тогда	//+МАН 13.12.24 Убрал: И Не ЗначениеЗаполнено(Документ). Заявка 2805
	// -- Сербаев 10.05.2023
	
		//+МАН 13.12.24 Добавил: ИЛИ Не ЗначениеЗаполнено(Документ) ИЛИ ПустаяСтрока(Серия)
		Если ПустаяСтрока(Номер) ИЛИ Дата = Дата(1,1,1) ИЛИ ПустаяСтрока(КемВыдан) ИЛИ НЕ ЗначениеЗаполнено(Документ)
			ИЛИ ПустаяСтрока(Серия) Тогда
		//-МАН
			Сообщить("Необходимо выбрать документ, указать номер, дату выдачи и кем он выдан!");//+МАН 13.12.24 Изменил сообщение. Заявка 2805
		    Возврат;
		КонецЕсли;	
	КонецЕсли;	 
	
	СтруктураВозврата = новый Структура();	
	Если ВыбранаСменаФИО Тогда
		СтруктураВозврата.Вставить("ПричинаИзмененияФИО", ПричинаИзменения_СменаФИО);
		ОснованиеИзмененияФИО = ПолучитьОснованиеИзмененияФИО();
		СтруктураВозврата.Вставить("ОснованиеИзмененияФИО", ОснованиеИзмененияФИО);
	ИначеЕсли ВыбраноИсправлениеФИО Тогда          
		СтруктураВозврата.Вставить("ПричинаИзмененияФИО", ПричинаИзмененияФИО_ИсправлениеФИО);
		СтруктураВозврата.Вставить("ОснованиеИзмененияФИО", ПредопределенноеЗначение("Справочник.ЛБ_ОснованияИзмененияФИО.ПустаяСсылка"));
	КонецЕсли;
	Закрыть(СтруктураВозврата);
КонецПроцедуры

// ++ Сербаев 10.05.2023
&НаКлиенте
Процедура ВыбраноИсправлениеФИОПриИзменении(Элемент)
	
	Если ВыбраноИсправлениеФИО Тогда
	    ВыбранаСменаФИО = Ложь;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбранаСменаФИОПриИзменении(Элемент)
	
	Если ВыбранаСменаФИО Тогда  
	    ВыбраноИсправлениеФИО = Ложь;
	КонецЕсли;
	
	УстановитьВидимость(); 
	
КонецПроцедуры
// -- Сербаев 10.05.2023
